# Parameter Filter Rule Factory Class

Source: https://www.revitapidocs.com/2026/317755a4-24ba-9f36-7639-f6fb2aa5a1a7.htm

---

| Parameter Filter Rule Factory Class |
| --- |

Contains functions that create appropriate FilterRule objects based on the parameters given. Inheritance Hierarchy System Object
Autodesk.Revit.DB ParameterFilterRuleFactory

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ParameterFilterRuleFactory : IDisposable
```

```
Public Class ParameterFilterRuleFactory
	Implements IDisposable
```

```
public ref class ParameterFilterRuleFactory : IDisposable
```

```
type ParameterFilterRuleFactory =
    class
        interface IDisposable
    end
```
The ParameterFilterRuleFactory type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateBeginsWithRule | Creates a filter rule that determines whether strings from the document  begin with a certain string value. |
|  | CreateContainsRule | Creates a filter rule that determines whether strings from the document contain  a certain string value. |
|  | CreateEndsWithRule | Creates a filter rule that determines whether strings from the document  end with a certain string value. |
|  | CreateEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document equal a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are greater than or equal to a certain value. |
|  | CreateGreaterRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are greater than a certain value. |
|  | CreateHasNoValueParameterRule | Creates a filter rule that determines whether an element's parameter does not have a value. |
|  | CreateHasValueParameterRule | Creates a filter rule that determines whether an element's parameter has a value. |
|  | CreateIsAssociatedWithGlobalParameterRule | Creates a filter rule that determines whether a parameter is associated  with a certain global parameter. |
|  | CreateIsNotAssociatedWithGlobalParameterRule | Creates a filter rule that determines whether a parameter is not associated  with a certain global parameter. |
|  | CreateLessOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are less than or equal to a certain value. |
|  | CreateLessRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are less than a certain value. |
|  | CreateLessRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are less than a certain value. |
|  | CreateLessRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are less than a certain value. |
|  | CreateLessRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are less than a certain value. |
|  | CreateNotBeginsWithRule | Creates a filter rule that determines whether strings from the document  do not begin with a certain string value. |
|  | CreateNotContainsRule | Creates a filter rule that determines whether strings from the document do not  contain a certain string value. |
|  | CreateNotEndsWithRule | Creates a filter rule that determines whether strings from the document  do not end with a certain string value. |
|  | CreateNotEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document do not equal a certain value. |
|  | CreateSharedParameterApplicableRule | Creates a filter rule that tests elements for support of a shared parameter. |
|  | Dispose | Releases all resources used by the ParameterFilterRuleFactory |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace